#! /usr/bin/env python3

import MeCab
from janome.tokenizer import Tokenizer
import os, time

def get_time(func):
    """ 関数処理時間計測用デコレータ
    """
    def wrapper(*args, **kwargs):
        t0 = time.time()
        func(*args, **kwargs)
        delta = time.time() - t0
        print(f"Time[{func.__name__}]: {delta}s")
    return wrapper

# MeCab
@get_time
def use_mecab(s):
    ma = MeCab.Tagger()
    _ = ma.parse(s)
    #print(_)

# Janome
@get_time
def use_janome(s):
    t = Tokenizer()
    _ = ''
    for token in t.tokenize(s):
        _ += str(token)+'\n'
    #print(_)

if __name__ == "__main__":
    
    sentence = "ある日の事でございます。御釈迦様おしゃかさまは極楽の蓮池はすいけのふちを、独りでぶらぶら御歩きになっていらっしゃいました。池の中に咲いている蓮はすの花は、みんな玉のようにまっ白で、そのまん中にある金色きんいろの蕊ずいからは、何とも云えない好よい匂においが、絶間たえまなくあたりへ溢あふれて居ります。極楽は丁度朝なのでございましょう。　やがて御釈迦様はその池のふちに御佇おたたずみになって、水の面おもてを蔽おおっている蓮の葉の間から、ふと下の容子ようすを御覧になりました。この極楽の蓮池の下は、丁度地獄じごくの底に当って居りますから、水晶すいしようのような水を透き徹して、三途さんずの河や針の山の景色が、丁度覗のぞき眼鏡めがねを見るように、はっきりと見えるのでございます。　するとその地獄の底に、陀多かんだたと云う男が一人、ほかの罪人と一しょに蠢うごめいている姿が、御眼に止まりました。この陀多と云う男は、人を殺したり家に火をつけたり、いろいろ悪事を働いた大泥坊でございますが、それでもたった一つ、善い事を致した覚えがございます。と申しますのは、ある時この男が深い林の中を通りますと、小さな蜘蛛くもが一匹、路ばたを這はって行くのが見えました。そこで陀多は早速足を挙げて、踏み殺そうと致しましたが、「いや、いや、これも小さいながら、命のあるものに違いない。その命を無暗むやみにとると云う事は、いくら何でも可哀そうだ。」と、こう急に思い返して、とうとうその蜘蛛を殺さずに助けてやったからでございます。　御釈迦様は地獄の容子を御覧になりながら、この陀多には蜘蛛を助けた事があるのを御思い出しになりました。そうしてそれだけの善い事をした報むくいには、出来るなら、この男を地獄から救い出してやろうと御考えになりました。幸い、側を見ますと、翡翠ひすいのような色をした蓮の葉の上に、極楽の蜘蛛が一匹、美しい銀色の糸をかけて居ります。御釈迦様はその蜘蛛の糸をそっと御手に御取りになって、玉のような白蓮しらはすの間から、遥か下にある地獄の底へ、まっすぐにそれを御下おろしなさいました。　こちらは地獄の底の血の池で、ほかの罪人と一しょに、浮いたり沈んだりしていた陀多かんだたでございます。何しろどちらを見ても、まっ暗で、たまにそのくら暗からぼんやり浮き上っているものがあると思いますと、それは恐しい針の山の針が光るのでございますから、その心細さと云ったらございません。その上あたりは墓の中のようにしんと静まり返って、たまに聞えるものと云っては、ただ罪人がつく微かすかな嘆息たんそくばかりでございます。これはここへ落ちて来るほどの人間は、もうさまざまな地獄の責苦せめくに疲れはてて、泣声を出す力さえなくなっているのでございましょう。ですからさすが大泥坊の陀多も、やはり血の池の血に咽むせびながら、まるで死にかかった蛙かわずのように、ただもがいてばかり居りました。ところがある時の事でございます。何気なにげなく陀多が頭を挙げて、血の池の空を眺めますと、そのひっそりとした暗の中を、遠い遠い天上から、銀色の蜘蛛くもの糸が、まるで人目にかかるのを恐れるように、一すじ細く光りながら、するすると自分の上へ垂れて参るのではございませんか。陀多はこれを見ると、思わず手を拍うって喜びました。この糸に縋すがりついて、どこまでものぼって行けば、きっと地獄からぬけ出せるのに相違ございません。いや、うまく行くと、極楽へはいる事さえも出来ましょう。そうすれば、もう針の山へ追い上げられる事もなくなれば、血の池に沈められる事もある筈はございません。　こう思いましたから陀多かんだたは、早速その蜘蛛の糸を両手でしっかりとつかみながら、一生懸命に上へ上へとたぐりのぼり始めました。元より大泥坊の事でございますから、こう云う事には昔から、慣れ切っているのでございます。　しかし地獄と極楽との間は、何万里となくございますから、いくら焦あせって見た所で、容易に上へは出られません。ややしばらくのぼる中うちに、とうとう陀多もくたびれて、もう一たぐりも上の方へはのぼれなくなってしまいました。そこで仕方がございませんから、まず一休み休むつもりで、糸の中途にぶら下りながら、遥かに目の下を見下しました。　すると、一生懸命にのぼった甲斐があって、さっきまで自分がいた血の池は、今ではもう暗の底にいつの間にかかくれて居ります。それからあのぼんやり光っている恐しい針の山も、足の下になってしまいました。この分でのぼって行けば、地獄からぬけ出すのも、存外わけがないかも知れません。陀多は両手を蜘蛛の糸にからみながら、ここへ来てから何年にも出した事のない声で、「しめた。しめた。」と笑いました。ところがふと気がつきますと、蜘蛛の糸の下の方には、数限かずかぎりもない罪人たちが、自分ののぼった後をつけて、まるで蟻ありの行列のように、やはり上へ上へ一心によじのぼって来るではございませんか。陀多はこれを見ると、驚いたのと恐しいのとで、しばらくはただ、莫迦ばかのように大きな口を開あいたまま、眼ばかり動かして居りました。自分一人でさえ断きれそうな、この細い蜘蛛の糸が、どうしてあれだけの人数にんずの重みに堪える事が出来ましょう。もし万一途中で断きれたと致しましたら、折角ここへまでのぼって来たこの肝腎かんじんな自分までも、元の地獄へ逆落さかおとしに落ちてしまわなければなりません。そんな事があったら、大変でございます。が、そう云う中にも、罪人たちは何百となく何千となく、まっ暗な血の池の底から、うようよと這はい上って、細く光っている蜘蛛の糸を、一列になりながら、せっせとのぼって参ります。今の中にどうかしなければ、糸はまん中から二つに断れて、落ちてしまうのに違いありません。　そこで陀多は大きな声を出して、「こら、罪人ども。この蜘蛛の糸は己おれのものだぞ。お前たちは一体誰に尋きいて、のぼって来た。下りろ。下りろ。」と喚わめきました。　その途端でございます。今まで何ともなかった蜘蛛の糸が、急に陀多のぶら下っている所から、ぷつりと音を立てて断きれました。ですから陀多もたまりません。あっと云う間まもなく風を切って、独楽こまのようにくるくるまわりながら、見る見る中に暗の底へ、まっさかさまに落ちてしまいました。　後にはただ極楽の蜘蛛の糸が、きらきらと細く光りながら、月も星もない空の中途に、短く垂れているばかりでございます。　御釈迦様おしゃかさまは極楽の蓮池はすいけのふちに立って、この一部始終しじゅうをじっと見ていらっしゃいましたが、やがて陀多かんだたが血の池の底へ石のように沈んでしまいますと、悲しそうな御顔をなさりながら、またぶらぶら御歩きになり始めました。自分ばかり地獄からぬけ出そうとする、陀多の無慈悲な心が、そうしてその心相当な罰をうけて、元の地獄へ落ちてしまったのが、御釈迦様の御目から見ると、浅間しく思召されたのでございましょう。　しかし極楽の蓮池の蓮は、少しもそんな事には頓着とんじゃく致しません。その玉のような白い花は、御釈迦様の御足おみあしのまわりに、ゆらゆら萼うてなを動かして、そのまん中にある金色の蕊ずいからは、何とも云えない好よい匂が、絶間たえまなくあたりへ溢あふれて居ります。極楽ももう午ひるに近くなったのでございましょう。"

    use_mecab(sentence)
    use_janome(sentence)